In [1]:
import pandas as pd

In [2]:
train_df=pd.read_csv("train.csv")
test_df=pd.read_csv("test.csv")

In [3]:
train_df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [4]:
test_df.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [5]:
#결측치 채우기
train_df['Age'].fillna(train_df['Age'].mean(), inplace=True)
test_df['Age'].fillna(test_df['Age'].mean(), inplace=True)

In [6]:
#열 삭제 (PassengerId, Ticket, Cabin, Name)
train_df.drop(['PassengerId', 'Ticket', 'Cabin','Name'],axis=1, inplace=True)
test_df.drop(['Ticket', 'Cabin','Name'],axis=1, inplace=True)

In [7]:
#인코딩
train_sex_dummies=pd.get_dummies(train_df['Sex'])
test_sex_dummies=pd.get_dummies(test_df['Sex'])

In [8]:
train_df.drop(['Sex'],axis=1, inplace=True)
test_df.drop(['Sex'],axis=1, inplace=True)

In [10]:
train_df=train_df.join(train_sex_dummies)
test_df=test_df.join(test_sex_dummies)

In [11]:
train_Embarked_dummies=pd.get_dummies(train_df['Embarked'])
test_Embarked_dummies=pd.get_dummies(test_df['Embarked'])

In [12]:
train_df.drop(['Embarked'], axis=1, inplace=True)
test_df.drop(['Embarked'], axis=1, inplace=True)

In [14]:
train_df=train_df.join(train_Embarked_dummies)
test_df=test_df.join(test_Embarked_dummies)

In [15]:
train_df

     Survived  Pclass        Age  SibSp  Parch     Fare  female  male  C  Q  S
0           0       3  22.000000      1      0   7.2500       0     1  0  0  1
1           1       1  38.000000      1      0  71.2833       1     0  1  0  0
2           1       3  26.000000      0      0   7.9250       1     0  0  0  1
3           1       1  35.000000      1      0  53.1000       1     0  0  0  1
4           0       3  35.000000      0      0   8.0500       0     1  0  0  1
..        ...     ...        ...    ...    ...      ...     ...   ... .. .. ..
886         0       2  27.000000      0      0  13.0000       0     1  0  0  1
887         1       1  19.000000      0      0  30.0000       1     0  0  0  1
888         0       3  29.699118      1      2  23.4500       1     0  0  0  1
889         1       1  26.000000      0      0  30.0000       0     1  1  0  0
890         0       3  32.000000      0      0   7.7500       0     1  0  1  0

[891 rows x 11 columns]

In [20]:
#test데이터 Fare컬럼 결측치 채우기
test_df['Fare'].fillna(0, inplace=True)